app/views/items/index.html.erb

  <p>
    <% @list.items.each do |item| %>
---
SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 28]]