app/views/items/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 28]]
---
<h2>Items:</h2>
<% @list.items.each do |i| %>