app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 28]]
---
def index
  @items = @list.items.all

INSERT INTO "items" ("created_at", "item", "list_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 13 Mar 2014 07:23:11 UTC +00:00], ["item", "sddfs"], ["list_id", 16], ["updated_at", Thu, 13 Mar 2014 07:23:11 UTC +00:00]]
---
  def create
    @item = @list.items.create(item_params)

UPDATE "items" SET "item" = ?, "updated_at" = ? WHERE "items"."id" = 34  [["item", "Test me"], ["updated_at", Tue, 01 Apr 2014 16:41:48 UTC +00:00]]
---
def update
    @item.update(item_params)

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "27"]]
SELECT "items".* FROM "items" WHERE "items"."list_id" = ? AND "items"."id" = ? LIMIT 1  [["list_id", 27], ["id", "31"]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 31]]
---
  def destroy
    @list = List.find(params[:list_id])
     @items = @list.items.find(params[:id])
     @items.destroy

SELECT "items".* FROM "items" WHERE "items"."list_id" = ? AND "items"."id" = ? LIMIT 1  [["list_id", 28], ["id", "34"]]
---
  def set_item
    @item = @list.items.find(params[:id])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "28"]]
---
  def set_list
          @list = List.find(params[:list_id])