app/controllers/list_controller.rb

SELECT "lists".* FROM "lists"
---
  def index
    @list = List.all

INSERT INTO "lists" ("created_at", "title", "updated_at") VALUES (?, ?, ?)  [["created_at", Sat, 22 Feb 2014 04:12:15 UTC +00:00], ["title", "kk list"], ["updated_at", Sat, 22 Feb 2014 04:12:15 UTC +00:00]]
---
  def create
    @list = List.new (list_params)

   if  @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "13"]]
UPDATE "lists" SET "title" = ?, "updated_at" = ? WHERE "lists"."id" = 13  [["title", "lkhjk;kl;"], ["updated_at", Tue, 25 Feb 2014 04:54:29 UTC +00:00]]
---
def update
    @list = List.find(params[:id])
    if @list.update(params[:list].permit(:title))