app/views/list/show.html.erb

SELECT "items".* FROM "items" WHERE "items"."list_id" = ?  [["list_id", 15]]
---
<h2>Items</h2>
<% @list.item.each do |i| %>